error_Code = 
{
	-- 10001 - 19999 login使用
	10001 = "User have already been in room",

	--20001 - 29999 room使用
	20001 = "网络错误，请重启游戏",--"玩家已在房间内",
	20002 = "玩家已在桌子上",
	20003 = "玩家已坐下",
	20004 = "玩家已准备",
	20005 = "房间不存在",
	20006 = "玩家不在房间内",
	20007 = "桌子不存在",
	20008 = "人数已满",
	20009 = "玩家已准备",
	20010 = "玩家不存在",
	20011 = "玩家已在游戏中",
	20012 = "没有发起投票",
	20013 = "玩家没权限参与投票",
	20014 = "玩家已投过票",
    20015 = "房主没进房间",
	20016 = "不是房主无权进行该操作"，
	20017 = "无批量开放列表，无权解散房间"，
	20018 = "刷新太过频繁，请稍后重试"，	


	--30001 - 39999 game使用
	30001 = "游戏已结束",
	30002 = "玩家不能进行该操作",
	30003 = "操作成功等待其他玩家选择"

	50001 = "俱乐部房卡不足，无法创建房间，请联系管理员"
	50002 = "钻石不足，无法创建房间，请联系俱乐部管理员"
	50003 = "钻石不足，无法加入房间，请联系俱乐部管理员"

	60001 = "已经报名天梯竞技场"




	[-10] = "参数不完整",
	[-11] = "请求错误返回",
	[-12] = "status 错误",

	[-100] = "无法获取你的地理信息，请打开gps定位",
	[-101] = "有玩家和您的位置相近或IP区段相同，无法加入该房间",
	[-200] = "活动服务器未开放，请通知系统管理人员",
	[-201] = "活动服务器房间达到上限，请通知系统管理人员",
	[-202] = "代开房间，开房数量达到上限",
	[-203] = "竞技场未开发，请通知系统管理人员",
	[-204] = "已经加入其它房间，无法加入竞技场",

}
